{
  "controls": {
    "1.1.1": {
      "title": "1.1.1 Ensure that the API server pod specification file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires the API server pod specification manifest be mode 600 (owner read/write only). It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) in Discovery (TA0007) / Defense Evasion (TA0005) by denying broad read or tamper access. OpenShift enforces this through MachineConfig-driven immutable host layers, RBAC-restricted manifest access, and operator reconciliation. Mitigation: M1022."
    },
    "1.1.2": {
      "title": "1.1.2 Ensure that the API server pod specification file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires the API server pod specification file be owned root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by preventing delegated ownership changes. OpenShift secures ownership with immutable host filesystem layers and RBAC-limited operator access. Mitigation: M1026."
    },
    "1.1.3": {
      "title": "1.1.3 Ensure that the controller manager pod specification file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires the controller manager pod manifest be permissioned 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by restricting read/write avenues. OpenShift maintains ACLs via MachineConfig and operator reconciliation. Mitigation: M1022."
    },
    "1.1.4": {
      "title": "1.1.4 Ensure that the controller manager pod specification file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires controller manager manifest ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) across Defense Evasion (TA0005) / Discovery (TA0007) by preventing non-root takeover. OpenShift enforces ownership with immutable images and RBAC separation. Mitigation: M1026."
    },
    "1.1.5": {
      "title": "1.1.5 Ensure that the scheduler pod specification file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires the scheduler static pod manifest be 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by denying group/world visibility. OpenShift enforces permissions through MachineConfig and operator reconciliation. Mitigation: M1022."
    },
    "1.1.6": {
      "title": "1.1.6 Ensure that the scheduler pod specification file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires scheduler manifest ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by removing alternate write owners. OpenShift protects ownership through immutable hosts and RBAC-limited operator actions. Mitigation: M1026."
    },
    "1.1.7": {
      "title": "1.1.7 Ensure that the etcd pod specification file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires etcd pod manifest files be permissioned 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by denying broad inspection or tampering. OpenShift enforces via config management and operator reconciliation. Mitigation: M1022."
    },
    "1.1.8": {
      "title": "1.1.8 Ensure that the etcd pod specification file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires etcd manifest ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) by preventing rogue ownership shifts (Defense Evasion TA0005 / Discovery TA0007). OpenShift ensures this with immutable host layers and operator reconciliation. Mitigation: M1026."
    },
    "1.1.9": {
      "title": "1.1.9 Ensure that the Container Network Interface file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires CNI configuration files be 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by limiting network plugin reconnaissance or edits. OpenShift network operators apply and preserve ACLs. Mitigation: M1022."
    },
    "1.1.10": {
      "title": "1.1.10 Ensure that the Container Network Interface file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires root:root ownership of CNI configuration files. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by restricting unauthorized network stack changes. OpenShift operators enforce ownership and revert drift. Mitigation: M1026."
    },
    "1.1.11": {
      "title": "1.1.11 Ensure that the etcd data directory permissions are set to 700 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires etcd data directory permissions 700. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by blocking non-owner traversal. OpenShift adds encryption and process confinement for layered protection. Mitigation: M1022."
    },
    "1.1.12": {
      "title": "1.1.12 Ensure that the etcd data directory ownership is set to etcd:etcd",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires etcd data directory ownership etcd:etcd. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by constraining write authority to the service user. OpenShift uses dedicated systemd units and SELinux labels. Mitigation: M1026."
    },
    "1.1.13": {
      "title": "1.1.13 Ensure that the kubeconfig file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires kubeconfig files be 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by limiting endpoint and credential exposure. OpenShift applies ACLs, PKI issuance, and RBAC gating. Mitigation: M1022."
    },
    "1.1.14": {
      "title": "1.1.14 Ensure that the kubeconfig file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires kubeconfig ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) across Defense Evasion (TA0005) / Discovery (TA0007) by denying unprivileged rewrites. OpenShift enforces via immutable hosts and operator reconciliation. Mitigation: M1026."
    },
    "1.1.15": {
      "title": "1.1.15 Ensure that the Scheduler kubeconfig file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires scheduler kubeconfig permissions 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by protecting embedded credentials. OpenShift enforces via ACLs and certificate rotation. Mitigation: M1022."
    },
    "1.1.16": {
      "title": "1.1.16 Ensure that the Scheduler kubeconfig file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires scheduler kubeconfig ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by stopping credential redirection. OpenShift preserves ownership through immutable OS layers. Mitigation: M1026."
    },
    "1.1.17": {
      "title": "1.1.17 Ensure that the Controller Manager kubeconfig file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires controller manager kubeconfig permissions 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by restricting credential exposure. OpenShift enforces ACLs and rotation. Mitigation: M1022."
    },
    "1.1.18": {
      "title": "1.1.18 Ensure that the Controller Manager kubeconfig file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires controller manager kubeconfig ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by preventing unauthorized credential redirection. OpenShift enforces via immutable host, SELinux, and operators. Mitigation: M1026."
    },
    "1.1.19": {
      "title": "1.1.19 Ensure that the OpenShift PKI directory and file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires OpenShift PKI directory/file ownership root:root. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by restricting certificate/key tampering. OpenShift PKI operators and SELinux labels enforce protection. Mitigation: M1026."
    },
    "1.1.20": {
      "title": "1.1.20 Ensure that the OpenShift PKI certificate file permissions are set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires PKI certificate files be 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by limiting chain reconnaissance/tamper paths. OpenShift PKI operators and ACLs enforce. Mitigation: M1022."
    },
    "1.1.21": {
      "title": "1.1.21 Ensure that the OpenShift PKI key file permissions are set to 600",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires PKI private key files be 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by preventing disclosure or replacement. OpenShift protects keys via root directories, SELinux, and operator rotation. Mitigation: M1022."
    },
    "1.2.1": {
      "title": "1.2.1 Ensure that anonymous requests are authorized",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires that anonymous (unauthenticated) API requests are subjected to authorization instead of being implicitly allowed. It mitigates Valid Accounts misuse (T1078) mapped to Initial Access and Privilege Escalation (TA0001/TA0004) by removing a frictionless path to enumerate or invoke privileged operations anonymously. OpenShift enforces this through API server configuration (anonymous-auth=false / authorization-mode=RBAC) and RBAC policy evaluation so every request flows through subject review before resource access. Mitigation: M1026."
    },
    "1.2.2": {
      "title": "1.2.2 Use https for kubelet connections",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1041"]
      },
      "explanation": "This CIS control requires all kubelet interactions to occur over HTTPS rather than plain HTTP. It mitigates Credentials from Configuration/Files exposure (T1552) within the Credential Access (TA0006) tactic by preventing interception of tokens and client certs in transit. OpenShift configures the kubelet and API server with cluster-issued PKI certs and enforces TLS via systemd units and operators, ensuring encrypted, authenticated channels. Mitigation: M1041."
    },
    "1.2.3": {
      "title": "1.2.3 Ensure that the kubelet uses certificates to authenticate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "4.7 Limit Access to Script Tools"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires the kubelet to present client certificates for authenticating to the control plane. It mitigates misuse of Valid Accounts (T1078) associated with Initial Access and Privilege Escalation (TA0001/TA0004) by preventing unauthenticated node impersonation. OpenShift automates certificate issuance and rotation for kubelets through its cluster machine and certificate signing operators, integrating with RBAC to bind node identities securely. Mitigation: M1026."
    },
    "1.2.4": {
      "title": "1.2.4 Verify that the kubelet certificate authority is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "9.5 Implement Application Firewalls"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1041"]
      },
      "explanation": "This CIS control requires the API server (and peers) to trust only an approved certificate authority for kubelet client certs. It mitigates credential harvesting and secret interception (T1552) within Credential Access (TA0006) by rejecting spoofed or rogue certificates that could access cluster data. OpenShift’s integrated PKI and certificate authority management via operators ensures only platform-signed kubelet certs are honored and rotated. Mitigation: M1041."
    },
    "1.2.5": {
      "title": "1.2.5 Ensure that the --authorization-mode argument is not set to AlwaysAllow",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "14.2 Enable Firewall Filtering Between VLANs"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires avoiding the insecure AlwaysAllow authorization mode and using policy-driven modes (e.g., RBAC). It mitigates Valid Accounts abuse (T1078) tied to Initial Access and Privilege Escalation (TA0001/TA0004) by preventing unconditional acceptance of any authenticated identity’s requests. OpenShift enforces RBAC as the authorization backend through cluster-kube-apiserver-operator configuration, ensuring every request is evaluated against roles and bindings. Mitigation: M1026."
    },
    "1.2.6": {
      "title": "1.2.6 Verify that RBAC is enabled",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires Role-Based Access Control be active for API authorization decisions. It mitigates misuse of Valid Accounts (T1078) in Initial Access and Privilege Escalation (TA0001/TA0004) by enforcing least privilege boundaries on every verb/resource combination. OpenShift natively enables RBAC and layers SCC admission, namespace scoping, and operator-managed roles to constrain privilege expansion. Mitigation: M1026."
    },
    "1.2.7": {
      "title": "1.2.7 Ensure that the APIPriorityAndFairness feature gate is enabled",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.12 Segment Data Processing and Storage Based on Sensitivity",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1499"],
        "tactics": ["TA0040"],
        "mitigations": ["M1037"]
      },
      "explanation": "This CIS control requires enabling APIPriorityAndFairness to apply priority and concurrency limits to API requests. It mitigates Resource Hijacking / Exhaustion patterns like Endpoint Denial of Service (T1499) under the Impact (TA0040) tactic by preventing low-priority floods from starving critical operations. OpenShift configures and maintains this feature gate in the API server via operators, shaping queues and flow schemas to sustain service availability. Mitigation: M1037."
    },
    "1.2.8": {
      "title": "1.2.8 Ensure that the admission control plugin AlwaysAdmit is not set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.1 Establish and Maintain a Secure Configuration Process",
        "cisv7": "5.4 Deploy System Configuration Management Tools"
      },
      "mitre": {
        "techniques": ["T1106"],
        "tactics": ["TA0002"],
        "mitigations": ["M1038"]
      },
      "explanation": "This CIS control requires disabling the permissive AlwaysAdmit admission plugin. It mitigates abuse of Native API Execution (T1106) within the Execution (TA0002) tactic by ensuring all create/update operations pass through structured admission validation and policy checks. OpenShift relies on a curated admission chain (SCCs, image policy, namespace lifecycle, quota, and webhooks) managed by cluster operators instead of Allow-All admission. Mitigation: M1038."
    },
    "1.2.9": {
      "title": "1.2.9 Ensure that the admission control plugin AlwaysPullImages is not set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "9.5 Implement Application Firewalls"
      },
      "mitre": {
        "techniques": ["T1195"],
        "tactics": ["TA0001"],
        "mitigations": ["M1016"]
      },
      "explanation": "This CIS control requires not enabling AlwaysPullImages so image retrieval follows trusted, policy-driven sources rather than unconditional pulls. It mitigates Supply Chain Compromise (T1195) in the Initial Access (TA0001) tactic by reducing exposure to swapped or newly poisoned registries at runtime. OpenShift enforces image provenance through ImageStreams, signature/policy enforcement, admission webhooks, and registry mirroring policies rather than blanket image pulls. Mitigation: M1016."
    },
    "1.2.10": {
      "title": "1.2.10 Ensure that the admission control plugin ServiceAccount is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0006"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires enabling the ServiceAccount admission plugin so pods receive properly managed service account tokens when intended. It mitigates Valid Accounts misuse (T1078) affecting Initial Access and Credential Access (TA0001/TA0006) by regulating automatic token creation, mounting, and secret references. OpenShift couples this admission plugin with automountServiceAccountToken defaults, RBAC, and token audience/expiration management to constrain credential sprawl. Mitigation: M1026."
    },
    "1.2.11": {
      "title": "1.2.11 Ensure that the admission control plugin NamespaceLifecycle is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1578"],
        "tactics": ["TA0005"],
        "mitigations": ["M1018"]
      },
      "explanation": "This CIS control requires the NamespaceLifecycle admission plugin remain enabled to block operations in terminating or nonexistent namespaces. It mitigates Modify Cloud Compute Infrastructure / orphan resource manipulation patterns (T1578) under Defense Evasion (TA0005) by preventing attackers from abusing inconsistent namespace states. OpenShift enforces this uniformly so namespace deletion, finalizers, and controlled cleanup proceed through operator and API safeguards. Mitigation: M1018."
    },
    "1.2.12": {
      "title": "1.2.12 Ensure that the admission control plugin SecurityContextConstraint is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.1 Establish and Maintain a Secure Configuration Process",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1611"],
        "tactics": ["TA0004"],
        "mitigations": ["M1048"]
      },
      "explanation": "This CIS control requires enabling the SecurityContextConstraint (SCC) admission plugin unique to OpenShift. It mitigates Escape to Host / Container Breakout (T1611) within Privilege Escalation (TA0004) by enforcing capabilities, user IDs, SELinux context, seccomp, and volume restrictions at admission. OpenShift ships predefined SCC tiers and uses RBAC binding to control which identities can request less restrictive execution profiles. Mitigation: M1048."
    },
    "1.2.13": {
      "title": "1.2.13 Ensure that the admission control plugin NodeRestriction is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1609"],
        "tactics": ["TA0008"],
        "mitigations": ["M1038"]
      },
      "explanation": "This CIS control requires enabling the NodeRestriction admission plugin to constrain what kubelets can modify (e.g., Node / Pod objects bound to themselves). It mitigates abuse of Container Administration Commands (T1609) aligned with Lateral Movement (TA0008) by preventing node identities from escalating control over other workloads or nodes. OpenShift activates and maintains this plugin in the API server configuration, pairing it with certificate-based node identities. Mitigation: M1038."
    },
    "1.2.14": {
      "title": "1.2.14 Ensure that the --insecure-bind-address argument is not set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "16.11 Leverage Vetted Modules or Services for Application Security Components",
        "cisv7": "9.2 Ensure Only Approved Ports, Protocols and Services Are Running"
      },
      "mitre": {
        "techniques": ["T1106"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
      "explanation": "This CIS control requires avoiding use of --insecure-bind-address for the API server. It mitigates Native API Execution (T1106) inside the Execution (TA0002) tactic by eliminating an unauthenticated cleartext listener that could expose administrative verbs. OpenShift binds control plane services only to secure interfaces with TLS and authentication enforced by cluster-managed PKI and firewalling. Mitigation: M1035."
    },
    "1.2.15": {
      "title": "1.2.15 Ensure that the --insecure-port argument is set to 0",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "16.11 Leverage Vetted Modules or Services for Application Security Components",
        "cisv7": "9.4 Apply Host-based Firewalls or Port Filtering"
      },
      "mitre": {
        "techniques": ["T1609"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
      "explanation": "This CIS control requires setting the API server --insecure-port to 0 to disable the unauthenticated port. It mitigates misuse of Container Administration / control interfaces (T1609) under Execution (TA0002) by removing a plaintext attack surface for issuing API calls. OpenShift configures the API server exclusively with secure TLS ports managed through operators and disallows the legacy insecure endpoint. Mitigation: M1035."
    },
    "1.2.16": {
      "title": "1.2.16 Ensure that the --secure-port argument is not set to 0",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1609"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
      "explanation": "This CIS control requires keeping a non-zero secure (TLS) port for the API server. It mitigates abuse of administrative execution paths (T1609) in Execution (TA0002) by ensuring all API traffic remains on an authenticated, encrypted channel. OpenShift’s API server operator maintains TLS endpoints with managed certificates and cipher policies, preventing downgrade or disablement. Mitigation: M1035."
    },
    "1.2.17": {
      "title": "1.2.17 Ensure that the healthz endpoint is protected by RBAC",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1078", "T1548"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1018"]
      },
      "explanation": "This CIS control requires securing the healthz (and related readiness/liveness) endpoints with authorization. It mitigates Valid Accounts (T1078) and Abuse Elevation Control Mechanism (T1548) under Initial Access and Privilege Escalation (TA0001/TA0004) by preventing reconnaissance or triggering of sensitive status paths without permission. OpenShift enforces this with RBAC, aggregated API server authn/z layers, and network policy where appropriate. Mitigation: M1018."
    },
    "1.2.18": {
      "title": "1.2.18 Ensure that the --audit-log-path argument is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.5 Collect Detailed Audit Logs",
        "cisv7": "6.2 Activate audit logging / 6.3 Enable Detailed Logging"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1047"]
      },
      "explanation": "This CIS control requires specifying an audit log file path for the API server. It mitigates detection gaps around Create or Modify System Process / persistence changes (T1543) spanning Persistence and Privilege Escalation (TA0003/TA0004) by generating forensic records of sensitive API operations. OpenShift integrates audit policy via the kube-apiserver operator and can forward logs to the cluster logging stack (e.g., Loki / Elasticsearch operators) for retention and analysis. Mitigation: M1047."
    },
    "1.2.19": {
      "title": "1.2.19 Ensure that the audit logs are forwarded off the cluster for retention",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.1 Establish and Maintain an Audit Log Management Process",
        "cisv7": "6.4 Ensure adequate storage for logs"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1047"]
      },
      "explanation": "This CIS control requires forwarding audit logs off-cluster for durable retention. It mitigates tampering or loss of evidence related to Create or Modify System Process (T1543) in Persistence / Privilege Escalation (TA0003/TA0004) by keeping records outside an attacker’s immediate blast radius. OpenShift supports log shipping through the Cluster Logging / Loki operators and external integrations (e.g., SIEM) for immutable storage and correlation. Mitigation: M1047."
    },
    "1.2.20": {
      "title": "1.2.20 Ensure that the maximumRetainedFiles argument is set to 10 or as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.3 Ensure Adequate Audit Log Storage",
        "cisv7": "6.4 Ensure adequate storage for logs"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1047"]
      },
      "explanation": "This CIS control requires configuring a sufficient number of rotated audit log files (e.g., maximumRetainedFiles). It mitigates loss of evidence for Create or Modify System Process (T1543) across Persistence / Privilege Escalation (TA0003/TA0004) by ensuring historical events are preserved during rotation cycles. OpenShift manages audit policy via operator CRs, and external log forwarders ingest rotations before truncation. Mitigation: M1047."
    },
    "1.2.21": {
      "title": "1.2.21 Configure Kubernetes API Server Maximum Audit Log Size",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.3 Ensure Adequate Audit Log Storage",
        "cisv7": "6.4 Ensure adequate storage for logs"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1047"]
      },
      "explanation": "This CIS control requires setting a maximum audit log file size to govern rotation cadence. It mitigates evidence suppression risks tied to Create or Modify System Process (T1543) in Persistence / Privilege Escalation (TA0003/TA0004) by balancing retention and storage limits without truncating active files. OpenShift’s API server operator applies these log size parameters and integrates with log forwarding for centralized archival. Mitigation: M1047."
    },
    "1.2.22": {
      "title": "1.2.22 Ensure that the --request-timeout argument is set",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.1 Establish and Maintain a Secure Configuration Process",
        "cisv7": "5.1 Establish Secure Configurations"
      },
      "mitre": {
        "techniques": ["T1499"],
        "tactics": ["TA0040"],
        "mitigations": ["M1037"]
      },
      "explanation": "This CIS control requires defining a request timeout for API server operations. It mitigates Denial of Service via resource exhaustion (T1499) under the Impact (TA0040) tactic by preventing indefinitely hanging or abusive long-running requests. OpenShift’s operator-driven API configuration and APIPriorityAndFairness combine to enforce fair cancellation, freeing server capacity. Mitigation: M1037."
    },
    "1.2.23": {
      "title": "1.2.23 Ensure that the --service-account-lookup argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.7 Enforce Access Control to Data through Automated Tools"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires enabling service account token lookup to validate existence and revocation state. It mitigates Valid Accounts reuse (T1078) in Initial Access (TA0001) by preventing continued acceptance of tokens belonging to deleted or altered service accounts. OpenShift’s token volume projection, short-lived token issuance, and API validation ensure stale identities are invalidated promptly. Mitigation: M1026."
    },
    "1.2.24": {
      "title": "1.2.24 Ensure that the --service-account-key-file argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.2 Use Unique Passwords",
        "cisv7": "4.4 Use Unique Passwords"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001"],
        "mitigations": ["M1026"]
      },
      "explanation": "This CIS control requires explicitly providing the service account signing key file(s) rather than implicit or shared defaults. It mitigates misuse of Valid Accounts (T1078) in Initial Access (TA0001) by separating signing authority and enabling rotation without cross-impact. OpenShift manages distinct signing keys through cluster-kube-apiserver-operator and secures them with root ownership and file ACLs. Mitigation: M1026."
    },
    "1.2.25": {
      "title": "1.2.25 Ensure that the --etcd-certfile and --etcd-keyfile arguments are set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.8 Encrypt Sensitive Information at Rest"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
      "explanation": "This CIS control requires configuring an explicit etcd client certificate and key for the API server. It mitigates Credentials from Configuration/Files exposure (T1552) in Credential Access (TA0006) by enforcing mutually authenticated, encrypted connections to the datastore. OpenShift provisions etcd certificates through the etcd and kube-apiserver operators with rotation and trust anchored in the platform PKI. Mitigation: M1022."
    },
    "1.2.26": {
      "title": "1.2.26 Ensure that the --tls-cert-file and --tls-private-key-file arguments are set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
      "explanation": "This CIS control requires the API server specify its serving TLS certificate and private key files. It mitigates credential or secret interception (T1552) under Credential Access (TA0006) by ensuring encrypted endpoints rather than default or absent TLS. OpenShift’s API server operator provisions, rotates, and stores these materials in root-owned PKI directories managed with SELinux confinement. Mitigation: M1022."
    },
    "1.2.27": {
      "title": "1.2.27 Ensure that the --client-ca-file argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
      "explanation": "This CIS control requires setting a client certificate authority bundle for authenticating incoming API client certs. It mitigates credential replay / interception scenarios (T1552) in Credential Access (TA0006) by validating issuer trust before authorizing requests. OpenShift distributes trusted CA bundles via ConfigMaps and operators, ensuring consistent validation across control plane components. Mitigation: M1022."
    },
    "1.2.28": {
      "title": "1.2.28 Ensure that the --etcd-cafile argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
      "explanation": "This CIS control requires specifying the CA file used to validate etcd server certificates. It mitigates credential and secret interception (T1552) in Credential Access (TA0006) by preventing man-in-the-middle insertion between the API server and etcd. OpenShift’s etcd and API operators coordinate CA distribution and rotation to maintain a trusted encrypted channel. Mitigation: M1022."
    },
    "1.2.29": {
      "title": "1.2.29 Ensure that encryption providers are appropriately configured",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.8 Encrypt Sensitive Information at Rest"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
      "explanation": "This CIS control requires configuring encryption providers for sensitive API resources (e.g., Secrets) at rest. It mitigates credential harvesting (T1552) within Credential Access (TA0006) by encrypting datastore values so raw secrets cannot be read from etcd. OpenShift manages the encryption config via the cluster-kube-apiserver-operator and supports key rotation workflows to sustain protection. Mitigation: M1022."
    },
    "1.2.30": {
      "title": "1.2.30 Ensure that the API Server only makes use of Strong Cryptographic Ciphers",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "1.8 Utilize Client Certificates to Authenticate Hardware Assets"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1041"]
      },
      "explanation": "This CIS control requires limiting the API server to strong, modern TLS cipher suites. It mitigates credential/secret exposure (T1552) in Credential Access (TA0006) by preventing downgrade or weak cipher exploitation in transit. OpenShift sets cipher policies through API server operator configuration and platform-wide TLS security profiles, ensuring consistent hardened cryptography. Mitigation: M1041."
    },
    "1.2.31": {
      "title": "1.2.31 Ensure unsupported configuration overrides are not used",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "2.2 Ensure Authorized Software is Currently Supported",
        "cisv7": "2.2 Ensure Software is Supported by Vendor"
      },
      "mitre": {
        "techniques": ["T1106"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
      "explanation": "This CIS control requires avoiding use of unsupported API server configuration overrides that bypass managed defaults. It mitigates Native API Execution (T1106) in the Execution (TA0002) tactic by eliminating hidden or unstable code paths attackers could leverage. OpenShift centralizes supported configuration through operators (ClusterVersion, kube-apiserver operator) and rejects or overwrites unknown custom flags during reconciliation. Mitigation: M1035."
    },
    "1.3.1": {
      "title": "1.3.1 Ensure that controller manager healthz endpoints are protected by RBAC",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1078", "T1548"],
        "tactics": ["TA0001"],
        "mitigations": ["M1018"]
      },
  "explanation": "This CIS control requires RBAC protection of controller manager health endpoints. It mitigates Valid Accounts (T1078) and Abuse Elevation Control Mechanism (T1548) in Initial Access / Privilege Escalation (TA0001/TA0004) by blocking unauthorized status probing. OpenShift applies authn/z layers and RBAC gating. Mitigation: M1018."
    },
    "1.3.2": {
      "title": "1.3.2 Ensure that the --use-service-account-credentials argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.2 Use Unique Passwords",
        "cisv7": "4.4 Use Unique Passwords"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires --use-service-account-credentials so each controller uses a distinct service account. It mitigates Valid Accounts (T1078) in Initial Access (TA0001) by reducing credential blast radius. OpenShift configures separate service accounts with RBAC and rotation. Mitigation: M1026."
    },
    "1.3.3": {
      "title": "1.3.3 Ensure that the --service-account-private-key-file argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.2 Use Unique Passwords",
        "cisv7": "4.4 Use Unique Passwords"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires specifying a dedicated service account signing private key file. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by securing signing material. OpenShift stores signing keys root-owned with operator rotation. Mitigation: M1022."
    },
    "1.3.4": {
      "title": "1.3.4 Ensure that the --root-ca-file argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "13.10 Perform Application Layer Filtering",
        "cisv7": "4.4 Use Unique Passwords"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires setting the root CA file to validate TLS endpoints. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by rejecting spoofed services. OpenShift distributes trusted CA bundles via ConfigMaps. Mitigation: M1022."
    },
    "1.4.1": {
      "title": "1.4.1 Ensure that the healthz endpoints for the scheduler are protected by RBAC",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1609"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
  "explanation": "This CIS control requires RBAC protecting scheduler health endpoints. It mitigates Container Administration Commands (T1609) in Execution (TA0002) by denying probing of internal state. OpenShift enforces via authn/z and RBAC plus optional NetworkPolicies. Mitigation: M1035."
    },
    "1.4.2": {
      "title": "1.4.2 Verify that the scheduler API service is protected by RBAC",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "9.3 Maintain and Enforce Network-Based URL Filters",
        "cisv7": "9.2 Ensure Only Approved Ports, Protocols and Services Are Running"
      },
      "mitre": {
        "techniques": ["T1106"],
        "tactics": ["TA0002"],
        "mitigations": ["M1035"]
      },
  "explanation": "This CIS control requires the scheduler API service be RBAC-protected and securely bound. It mitigates Native API Execution (T1106) in Execution (TA0002) by preventing unauthenticated method calls. OpenShift restricts binding, applies TLS, and enforces RBAC. Mitigation: M1035."
    },
    "2.1": {
      "title": "2.1 Ensure that the --cert-file and --key-file arguments are set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires etcd cert/key files be configured. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by encrypting datastore traffic. OpenShift provisions and rotates certs via operators. Mitigation: M1022."
    },
    "2.2": {
      "title": "2.2 Ensure that the --client-cert-auth argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.8 Encrypt Sensitive Information at Rest"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires client certificate authentication for etcd. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by requiring mutual TLS. OpenShift manages CA issuance and rotation. Mitigation: M1022."
    },
    "2.3": {
      "title": "2.3 Ensure that the --auto-tls argument is not set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires disabling --auto-tls for etcd. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by preventing unmanaged self-signed certs. OpenShift supplies trusted certificates only. Mitigation: M1022."
    },
    "2.4": {
      "title": "2.4 Ensure that the --peer-cert-file and --peer-key-file arguments are set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires specifying peer cert/key for etcd. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by encrypting and authenticating replication. OpenShift configures and rotates peer certs via operator. Mitigation: M1022."
    },
    "2.5": {
      "title": "2.5 Ensure that the --peer-client-cert-auth argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires enabling peer client cert auth. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by rejecting unauthenticated peers. OpenShift enforces through CA-signed cert distribution. Mitigation: M1022."
    },
    "2.6": {
      "title": "2.6 Ensure that the --peer-auto-tls argument is not set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.2 Use Unique Passwords",
        "cisv7": "4.4 Use Unique Passwords"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires disabling peer auto TLS. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by enforcing issued, auditable certificates only. OpenShift operators provision sanctioned peer certs. Mitigation: M1022."
    },
    "2.7": {
      "title": "2.7 Ensure that a unique Certificate Authority is used for etcd",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.8 Encrypt Sensitive Information at Rest"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires a unique CA for etcd. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by isolating trust domains. OpenShift issues a dedicated etcd CA with rotation. Mitigation: M1022."
    },
    "3.1.1": {
      "title": "3.1.1 Client certificate authentication should not be used for users",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "16.11 Leverage Vetted Modules or Services for Application Security Components",
        "cisv7": "16.2 Configure Centralized Point of Authentication"
      },
      "mitre": {
        "techniques": ["T1078", "T1098"],
        "tactics": ["TA0003", "TA0006"],
        "mitigations": ["M1027", "M1032"]
      },
  "explanation": "This CIS control requires avoiding unmanaged user client cert auth in favor of central identity. It mitigates Account Manipulation (T1098) and Valid Accounts (T1078) in Persistence / Credential Access (TA0003/TA0006) by eliminating static certificates. OpenShift uses OAuth/OIDC, short-lived tokens, and IDPs. Mitigations: M1027, M1032."
    },
    "3.2.1": {
      "title": "3.2.1 Ensure that a minimal audit policy is created",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.2 Collect Audit Logs",
        "cisv7": "6.2 Activate audit logging"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires creating a minimal audit policy capturing core security events. It mitigates Create or Modify System Process (T1543) in Persistence / Privilege Escalation (TA0003/TA0004) by yielding baseline traceability. OpenShift applies audit policy via operators; logs feed external analysis. Mitigation: M1026."
    },
    "3.2.2": {
      "title": "3.2.2 Ensure that the audit policy covers key security concerns",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.5 Collect Detailed Audit Logs",
        "cisv7": "14.9 Enforce Detail Logging for Access or Changes to Sensitive Data"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires expanding audit policy to cover key security concerns. It mitigates Create or Modify System Process (T1543) in Persistence / Privilege Escalation (TA0003/TA0004) by logging sensitive access. OpenShift manages detailed audit categories through operator configuration. Mitigation: M1026."
    },
    "4.1.1": {
      "title": "4.1.1 Ensure that the kubelet service file permissions are set to 644 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires kubelet service file permissions 644 or stricter. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by narrowing tamper surface. OpenShift sets and preserves permissions via MachineConfig. Mitigation: M1022."
    },
    "4.1.2": {
      "title": "4.1.2 Ensure that the kubelet service file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires kubelet service file ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by preventing unauthorized parameter changes. OpenShift enforces via immutable host image. Mitigation: M1026."
    },
    "4.1.3": {
      "title": "4.1.3 If proxy kube proxy configuration file exists ensure permissions are set to 644 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires kube-proxy config file permissions 644. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) by limiting inspection and edits (Discovery TA0007 / Defense Evasion TA0005). OpenShift enforces through node config management. Mitigation: M1022."
    },
    "4.1.4": {
      "title": "4.1.4 If proxy kubeconfig file exists ensure ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires kube-proxy kubeconfig ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) (Defense Evasion TA0005 / Discovery TA0007) by restricting credential rerouting. OpenShift preserves ownership via immutable hosts. Mitigation: M1026."
    },
    "4.1.5": {
      "title": "4.1.5 Ensure that the --kubeconfig kubelet.conf file permissions are set to 644 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires kubelet kubeconfig permissions 644. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) by limiting credential exposure (Discovery TA0007 / Defense Evasion TA0005). OpenShift manages via MachineConfig. Mitigation: M1022."
    },
    "4.1.6": {
      "title": "4.1.6 Ensure that the --kubeconfig kubelet.conf file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires kubelet kubeconfig ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) by preventing credential replacement (Defense Evasion TA0005 / Discovery TA0007). OpenShift enforces via immutable host layers. Mitigation: M1026."
    },
    "4.1.7": {
      "title": "4.1.7 Ensure that the certificate authorities file permissions are set to 644 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires client CA file permissions 644. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by reducing trust anchor exposure. OpenShift enforces ACLs through config management. Mitigation: M1022."
    },
    "4.1.8": {
      "title": "4.1.8 Ensure that the client certificate authorities file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires client CA file ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) by blocking unauthorized trust anchor changes (Defense Evasion TA0005 / Discovery TA0007). OpenShift preserves ownership immutably. Mitigation: M1026."
    },
    "4.1.9": {
      "title": "4.1.9 Ensure that the kubelet --config configuration file has permissions set to 600 or more restrictive",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires kubelet config file permissions 600. It mitigates File and Directory Discovery (T1083) and File Permissions Modification (T1222) (Discovery TA0007 / Defense Evasion TA0005) by blocking unprivileged reads/edits. OpenShift applies via MachineConfig. Mitigation: M1022."
    },
    "4.1.10": {
      "title": "4.1.10 Ensure that the kubelet configuration file ownership is set to root:root",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1083", "T1222"],
        "tactics": ["TA0005", "TA0007"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires kubelet config ownership root:root. It mitigates File Permissions Modification (T1222) and File and Directory Discovery (T1083) by preventing flag tampering (Defense Evasion TA0005 / Discovery TA0007). OpenShift maintains via immutable OS. Mitigation: M1026."
    },
    "4.2.1": {
      "title": "4.2.1 Activate Garbage collection in OpenShift Container Platform 4, as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "10.5 Enable Anti-Exploitation Features",
        "cisv7": "5.1 Establish Secure Configurations"
      },
      "mitre": {
        "techniques": ["T1499"],
        "tactics": ["TA0040"],
        "mitigations": ["M1037"]
      },
  "explanation": "This CIS control requires enabling container/image garbage collection. It mitigates Resource Exhaustion (T1499) in Impact (TA0040) by reclaiming storage proactively. OpenShift tunes kubelet GC through MachineConfig. Mitigation: M1037."
    },
    "4.2.2": {
      "title": "4.2.2 Ensure that the --anonymous-auth argument is set to false",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1078", "T1133"],
        "tactics": ["TA0001"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires disabling anonymous kubelet auth. It mitigates Valid Accounts (T1078) and External Remote Services (T1133) in Initial Access (TA0001) by removing unauthenticated endpoints. OpenShift enforces flags via MachineConfig and RBAC. Mitigation: M1026."
    },
    "4.2.3": {
      "title": "4.2.3 Ensure that the --authorization-mode argument is not set to AlwaysAllow",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.3 Configure Data Access Control Lists",
        "cisv7": "9.2 Ensure Only Approved Ports, Protocols and Services Are Running"
      },
      "mitre": {
        "techniques": ["T1133"],
        "tactics": ["TA0001"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires avoiding AlwaysAllow authorization. It mitigates External Remote Services (T1133) in Initial Access (TA0001) by forcing RBAC evaluation. OpenShift configures webhook/RBAC modes only. Mitigation: M1026."
    },
    "4.2.4": {
      "title": "4.2.4 Ensure that the --client-ca-file argument is set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.11 Encrypt Sensitive Data at Rest",
        "cisv7": "14.8 Encrypt Sensitive Information at Rest"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires specifying a client CA for kubelet. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by validating client certs. OpenShift distributes CA bundles via operators. Mitigation: M1022."
    },
    "4.2.5": {
      "title": "4.2.5 Verify that the read only port is not used or is set to 0",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "9.2 Ensure Only Approved Ports, Protocols and Services Are Running"
      },
      "mitre": {
        "techniques": ["T1190"],
        "tactics": ["TA0001"],
        "mitigations": ["M1035"]
      },
  "explanation": "This CIS control requires disabling the kubelet read-only port. It mitigates Exploit Public-Facing Application (T1190) in Initial Access (TA0001) by eliminating an unauthenticated interface. OpenShift configures port=0 via MachineConfig. Mitigation: M1035."
    },
    "4.2.6": {
      "title": "4.2.6 Ensure that the --streaming-connection-idle-timeout argument is not set to 0",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "9.2 Ensure Only Approved Ports, Protocols and Services Are Running"
      },
      "mitre": {
        "techniques": ["T1499"],
        "tactics": ["TA0040"],
        "mitigations": ["M1037"]
      },
  "explanation": "This CIS control requires non-zero kubelet streaming idle timeout. It mitigates Resource Exhaustion (T1499) in Impact (TA0040) by closing idle exec/attach sessions. OpenShift manages timeout defaults in kubelet config. Mitigation: M1037."
    },
    "4.2.7": {
      "title": "4.2.7 Ensure that the --make-iptables-util-chains argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "14.7 Enforce Access Control to Data through Automated Tools"
      },
      "mitre": {
        "techniques": ["T1046"],
        "tactics": ["TA0007"],
        "mitigations": ["M1030"]
      },
  "explanation": "This CIS control requires kubelet manage iptables util chains. It mitigates Network Service Scanning (T1046) in Discovery (TA0007) by keeping firewall chains consistent with policy. OpenShift synchronizes via kube-proxy/OVN. Mitigation: M1030."
    },
    "4.2.8": {
      "title": "4.2.8 Ensure that the kubeAPIQPS [--event-qps] argument is set to 0 or a level which ensures appropriate event capture",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "8.5 Collect Detailed Audit Logs",
        "cisv7": "8.8 Enable Command-line Audit Logging"
      },
      "mitre": {
        "techniques": ["T1543"],
        "tactics": ["TA0003", "TA0004"],
        "mitigations": ["M1047"]
      },
  "explanation": "This CIS control requires tuning kubelet/API QPS to retain security events. It mitigates Create or Modify System Process (T1543) in Persistence / Privilege Escalation (TA0003/TA0004) by preventing event loss. OpenShift sets balanced QPS via MachineConfig. Mitigation: M1047."
    },
    "4.2.9": {
      "title": "4.2.9 Ensure that the --tls-cert-file and --tls-private-key-file arguments are set as appropriate",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1022"]
      },
  "explanation": "This CIS control requires specifying kubelet serving cert/key. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by encrypting API traffic. OpenShift provisions and rotates serving certs. Mitigation: M1022."
    },
    "4.2.10": {
      "title": "4.2.10 Ensure that the --rotate-certificates argument is not set to false",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1098"],
        "tactics": ["TA0003"],
        "mitigations": ["M1027"]
      },
  "explanation": "This CIS control requires kubelet client certificate rotation. It mitigates Account Manipulation (T1098) in Persistence (TA0003) by shortening credential lifetime. OpenShift automates CSR approval and renewal. Mitigation: M1027."
    },
    "4.2.11": {
      "title": "4.2.11 Verify that the RotateKubeletServerCertificate argument is set to true",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1098"],
        "tactics": ["TA0003"],
        "mitigations": ["M1027"]
      },
  "explanation": "This CIS control requires rotating kubelet serving certificates. It mitigates Account Manipulation (T1098) in Persistence (TA0003) by invalidating stale certs. OpenShift manages issuance via node cert controllers. Mitigation: M1027."
    },
    "4.2.12": {
      "title": "4.2.12 Ensure that the Kubelet only makes use of Strong Cryptographic Ciphers",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "1.8 Utilize Client Certificates to Authenticate Hardware Assets"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1041"]
      },
  "explanation": "This CIS control requires strong TLS ciphers for kubelet. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by preventing downgrade/weak crypto attacks. OpenShift sets cluster TLS security profiles. Mitigation: M1041."
    },
    "5.1.1": {
      "title": "5.1.1 Ensure that the cluster-admin role is only used where required",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1078", "T1078.002"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires limiting cluster-admin usage. It mitigates Valid Accounts (T1078/T1078.002) in Initial Access / Privilege Escalation (TA0001/TA0004) by shrinking high-privilege blast radius. OpenShift applies least privilege RBAC and auditing. Mitigation: M1026."
    },
    "5.1.2": {
      "title": "5.1.2 Minimize access to secrets",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.12 Segment Data Processing and Storage Based on Sensitivity",
        "cisv7": "13.4 Only Allow Access to Authorized Cloud Storage or Email Providers"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires minimizing secret read permissions. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by limiting enumeration paths. OpenShift namespaces, RBAC, and SCC boundaries reduce exposure. Mitigation: M1026."
    },
    "5.1.3": {
      "title": "5.1.3 Minimize wildcard use in Roles and ClusterRoles",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1078", "T1078.002"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires avoiding wildcard verbs/resources in RBAC. It mitigates Valid Accounts (T1078/T1078.002) in Initial Access / Privilege Escalation (TA0001/TA0004) by constraining privilege spread. OpenShift encourages granular role definitions and auditing. Mitigation: M1026."
    },
    "5.1.4": {
      "title": "5.1.4 Minimize access to create pods",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "2.7 Allowlist Authorized Scripts",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1078", "T1078.002"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires limiting who can create pods. It mitigates Valid Accounts (T1078/T1078.002) in Initial Access / Privilege Escalation (TA0001/TA0004) by preventing malicious workload deployment. OpenShift RBAC, SCC, and namespaces restrict creation. Mitigation: M1026."
    },
    "5.1.5": {
      "title": "5.1.5 Ensure that default service accounts are not actively used.",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.3 Disable Dormant Accounts",
        "cisv7": "16.9 Disable Dormant Accounts"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1028"]
      },
  "explanation": "This CIS control requires not using default service accounts. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by removing broadly scoped tokens. OpenShift supports dedicated service accounts and automount=false. Mitigation: M1028."
    },
    "5.1.6": {
      "title": "5.1.6 Ensure that Service Account Tokens are only mounted where necessary",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "13.4 Only Allow Access to Authorized Cloud Storage or Email Providers"
      },
      "mitre": {
        "techniques": ["T1528", "T1555"],
        "tactics": ["TA0006"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires mounting service account tokens only when needed. It mitigates Steal Application Access Token (T1528) and Credentials from Password Stores (T1555) in Credential Access (TA0006) by reducing token presence. OpenShift enforces via automount flags and projected tokens. Mitigation: M1026."
    },
    "5.2.1": {
      "title": "5.2.1 Minimize the admission of privileged containers",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1611"],
        "tactics": ["TA0004"],
        "mitigations": ["M1048"]
      },
  "explanation": "This CIS control requires avoiding privileged containers. It mitigates Escape to Host (T1611) in Privilege Escalation (TA0004) by removing broad host access. OpenShift SCCs gate privileged usage. Mitigation: M1048."
    },
    "5.2.2": {
      "title": "5.2.2 Minimize the admission of containers wishing to share the host process ID namespace",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1078", "T1078.002"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires minimizing hostPID usage. It mitigates Valid Accounts (T1078/T1078.002) in Initial Access / Privilege Escalation (TA0001/TA0004) by preventing host process observation. OpenShift SCCs deny hostPID by default. Mitigation: M1026."
    },
    "5.2.3": {
      "title": "5.2.3 Minimize the admission of containers wishing to share the host IPC namespace",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "13.10 Perform Application Layer Filtering",
        "cisv7": "12.9 Deploy Application Layer Filtering Proxy Server"
      },
      "mitre": {
        "techniques": ["T1078", "T1078.002"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires prohibiting hostIPC for general workloads. It mitigates Valid Accounts (T1078/T1078.002) in Initial Access / Privilege Escalation (TA0001/TA0004) by eliminating shared memory snooping paths. OpenShift SCCs block hostIPC. Mitigation: M1026."
    },
    "5.2.4": {
      "title": "5.2.4 Minimize the admission of containers wishing to share the host network namespace",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.12 Segment Data Processing and Storage Based on Sensitivity",
        "cisv7": "14.1 Segment the Network Based on Sensitivity"
      },
      "mitre": {
        "techniques": ["T1098"],
        "tactics": ["TA0003"],
        "mitigations": ["M1030"]
      },
  "explanation": "This CIS control requires minimizing hostNetwork usage. It mitigates Account Manipulation (T1098) in Persistence (TA0003) by preventing direct host network access. OpenShift SCCs and NetworkPolicies isolate networking. Mitigation: M1030."
    },
    "5.2.5": {
      "title": "5.2.5 Minimize the admission of containers with allowPrivilegeEscalation",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1611"],
        "tactics": ["TA0004"],
        "mitigations": ["M1038", "M1048"]
      },
  "explanation": "This CIS control requires allowPrivilegeEscalation=false. It mitigates Escape to Host (T1611) in Privilege Escalation (TA0004) by blocking new elevated capability acquisition. OpenShift SCC defaults and seccomp/capability drops enforce. Mitigations: M1038, M1048."
    },
    "5.2.6": {
      "title": "5.2.6 Minimize the admission of root containers",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "5.4 Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "cisv7": "4.3 Ensure the Use of Dedicated Administrative Accounts"
      },
      "mitre": {
        "techniques": ["T1098"],
        "tactics": ["TA0003"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires running as non-root when possible. It mitigates Account Manipulation (T1098) in Persistence (TA0003) by removing default UID 0 access. OpenShift SCC restricted profiles enforce non-root. Mitigation: M1026."
    },
    "5.2.7": {
      "title": "5.2.7 Minimize the admission of containers with the NET_RAW capability",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1068"],
        "tactics": ["TA0004"],
        "mitigations": ["M1050"]
      },
  "explanation": "This CIS control requires removing NET_RAW capability. It mitigates Exploitation for Privilege Escalation (T1068) in Privilege Escalation (TA0004) by blocking raw packet crafting. OpenShift SCC capability drops enforce. Mitigation: M1050."
    },
    "5.2.8": {
      "title": "5.2.8 Minimize the admission of containers with added capabilities",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1204"],
        "tactics": ["TA0002", "TA0003"],
        "mitigations": ["M1047"]
      },
  "explanation": "This CIS control requires avoiding added capabilities. It mitigates User Execution (T1204) in Execution (TA0002) and persistence setup (TA0003) by limiting privileged syscalls. OpenShift SCC allowedCapabilities policy enforces minimal sets. Mitigation: M1047."
    },
    "5.2.9": {
      "title": "5.2.9 Minimize the admission of containers with capabilities assigned",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.8 Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1204"],
        "tactics": ["TA0002", "TA0003"],
        "mitigations": ["M1045", "M1047"]
      },
  "explanation": "This CIS control requires dropping all unnecessary capabilities. It mitigates User Execution (T1204) in Execution (TA0002) / Persistence (TA0003) by removing privileged syscall vectors. OpenShift restricted SCC sets drop defaults. Mitigations: M1045, M1047."
    },
    "5.2.10": {
      "title": "5.2.10 Minimize access to privileged Security Context Constraints",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "6.8 Define and Maintain Role-Based Access Control",
        "cisv7": "4.7 Limit Access to Script Tools"
      },
      "mitre": {
        "techniques": ["T1078"],
        "tactics": ["TA0001", "TA0004"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires limiting privileged SCC access. It mitigates Valid Accounts (T1078) in Initial Access / Privilege Escalation (TA0001/TA0004) by denying broad escalation paths. OpenShift RBAC 'use' verb scopes SCC usage. Mitigation: M1026."
    },
    "5.3.1": {
      "title": "5.3.1 Ensure that the CNI in use supports Network Policies",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "9.5 Implement Application Firewalls"
      },
      "mitre": {
        "techniques": ["T1046"],
        "tactics": ["TA0007"],
        "mitigations": ["M1030", "M1042"]
      },
  "explanation": "This CIS control requires a CNI supporting NetworkPolicies. It mitigates Network Service Scanning (T1046) in Discovery (TA0007) by enforcing pod-level segmentation. OpenShift OVN/SDN implements NetworkPolicy semantics. Mitigations: M1030, M1042."
    },
    "5.3.2": {
      "title": "5.3.2 Ensure that all Namespaces have Network Policies defined",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "14.2 Enable Firewall Filtering Between VLANs"
      },
      "mitre": {
        "techniques": ["T1046"],
        "tactics": ["TA0007"],
        "mitigations": ["M1030", "M1042"]
      },
  "explanation": "This CIS control requires NetworkPolicies in every namespace. It mitigates Network Service Scanning (T1046) in Discovery (TA0007) by removing unrestricted lateral paths. OpenShift controllers enforce policies cluster-wide. Mitigations: M1030, M1042."
    },
    "5.4.1": {
      "title": "5.4.1 Prefer using secrets as files over secrets as environment variables",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.10 Encrypt Sensitive Data in Transit",
        "cisv7": "14.4 Encrypt All Sensitive Information in Transit"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control requires preferring secret volume mounts over environment variables. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by reducing accidental logging or proliferation. OpenShift supports file-based secret projection and rotation. Mitigation: M1026."
    },
    "5.4.2": {
      "title": "5.4.2 Consider external secret storage",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "3.12 Segment Data Processing and Storage Based on Sensitivity",
        "cisv7": "14.6 Protect Information through Access Control Lists"
      },
      "mitre": {
        "techniques": ["T1552"],
        "tactics": ["TA0006"],
        "mitigations": ["M1026"]
      },
  "explanation": "This CIS control recommends external secret storage integration. It mitigates Credentials from Configuration/Files (T1552) in Credential Access (TA0006) by centralizing rotation and access audit. OpenShift integrates with Vault/External Secrets Operator. Mitigation: M1026."
    },
    "5.5.1": {
      "title": "5.5.1 Configure Image Provenance using image controller configuration parameters",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.1 Establish and Maintain a Secure Configuration Process",
        "cisv7": "5.4 Deploy System Configuration Management Tools"
      },
      "mitre": {
        "techniques": ["T1133", "T1195"],
        "tactics": ["TA0001", "TA0003"],
        "mitigations": ["M1016", "M1042"]
      },
  "explanation": "This CIS control requires configuring image provenance (signatures/allowed registries). It mitigates Supply Chain Compromise (T1195) and External Remote Services (T1133) in Initial Access / Persistence (TA0001/TA0003) by restricting untrusted images. OpenShift ImageStreams and signature policies enforce sources. Mitigations: M1016, M1042."
    },
    "5.7.1": {
      "title": "5.7.1 Create administrative boundaries between resources using namespaces",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.4 Implement and Manage a Firewall on Servers",
        "cisv7": "9.5 Implement Application Firewalls"
      },
      "mitre": {
        "techniques": ["T1106", "T1609"],
        "tactics": ["TA0002", "TA0008"],
        "mitigations": ["M1038"]
      },
  "explanation": "This CIS control requires using namespaces for administrative boundaries. It mitigates Native API Execution (T1106) and Container Administration Commands (T1609) in Execution / Lateral Movement (TA0002/TA0008) by scoping RBAC and policies. OpenShift integrates namespaces with SCC, NetworkPolicies, and quotas. Mitigation: M1038."
    },
    "5.7.2": {
      "title": "5.7.2 Ensure that the seccomp profile is set to docker/default in your pod definitions",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.1 Establish and Maintain a Secure Configuration Process",
        "cisv7": "5.2 Maintain Secure Images"
      },
      "mitre": {
        "techniques": ["T1611"],
        "tactics": ["TA0004"],
        "mitigations": ["M1048"]
      },
  "explanation": "This CIS control requires setting a restrictive seccomp profile (runtime/default). It mitigates Escape to Host (T1611) in Privilege Escalation (TA0004) by filtering dangerous syscalls. OpenShift SCCs and pod security admission (optional) enforce profiles. Mitigation: M1048."
    },
    "5.7.3": {
      "title": "5.7.3 Apply Security Context to Your Pods and Containers",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "7.3 Perform Automated Operating System Patch Management",
        "cisv7": "8.3 Enable Operating System Anti-Exploitation Features/ Deploy Anti-Exploit Technologies"
      },
      "mitre": {
        "techniques": ["T1556", "T1611"],
        "tactics": ["TA0004", "TA0006"],
        "mitigations": ["M1048"]
      },
  "explanation": "This CIS control requires applying securityContext (runAsUser, capabilities, seccomp, fsGroup). It mitigates Modify Authentication Process (T1556) and Escape to Host (T1611) in Credential Access / Privilege Escalation (TA0006/TA0004) by constraining runtime privileges. OpenShift SCCs default/enforce these fields. Mitigation: M1048."
    },
    "5.7.4": {
      "title": "5.7.4 The default namespace should not be used",
      "cisVersion": "CIS OCP 1.8",
      "cisMapping": {
        "cisv8": "4.9 Configure Trusted DNS Servers on Enterprise Assets",
        "cisv7": "5 Secure Configuration for Hardware and Software on Mobile Devices, Laptops, Workstations and Servers"
      },
      "mitre": {
        "techniques": ["T1578"],
        "tactics": ["TA0005"],
        "mitigations": ["M1018"]
      },
  "explanation": "This CIS control requires avoiding the default namespace for workloads. It mitigates Modify Cloud Compute Infrastructure (T1578) in Defense Evasion (TA0005) by denying attackers a shared namespace to obscure changes. OpenShift uses namespace-scoped RBAC and policies for isolation. Mitigation: M1018."
    }
  }
}
